// Задача 12. Напишете програма, която чете 3 положителни числа и изписва 1, ако съществува триъгълник с такива страни, и 0, ако не съществува.

// Вход:
//  3 4 5
// Изход:
//  1

// Вход:
//  1 2 3
// Изход:
//  0

// за да съществъва един триъгълник всяка страна трябва да бъде полож. число(дадено по условие) и сбора на всеки две страни да е по-голям от третата страна
// a + b > c && a + c > b && b + c > a;

#include <iostream>
using namespace  std;

int main()
{
    double a,b,c;
    cin >> a >> b >> c;

    if((a + b > c) && (a + c > b) && (b + c > a)){
        cout << 1;
    } else {
        cout << 0;
    }
} 

