// Задача 13. Напишете програма, която приема 4 цели числа и отпечатва 1, ако числата образуват аритметична прогресия в реда, в който са въведени, и 0, ако не образуват.

// Вход:
//  1 2 3 4
// Изход:
//  1

// Вход:
//  7 6 3 2
// Изход:
//  0

#include <iostream>
using namespace std;

int main(){
    int num1, num2, num3, num4;
    cin >> num1 >> num2 >> num3 >> num4;

    // Проверяваме дали разликата между съседните членове е еднаква
    if ((num2 - num1 == num3 - num2) && (num3 - num2 == num4 - num3)) {
        cout << 1 << endl;
    } else {
        cout << 0 << endl;
    }

    return 0;
}

// 1. Аритметична прогресия
// Какво представлява? - Редица от числа, в която всеки следващ член се получава, като към предходния прибавиш едно и също число (наречено разлика или стъпка -> d).
// Основно правило: Разликата между всеки два съседни члена е постоянна (винаги се събира/вади едно и също число).
// Пример: 1, 3, 5, 7, 9
// Тук стъпката е +2 (3-1=2, 5-3=2, 7-5=2).
// Как се проверява в код? -> num2 - num1 == num3 - num2