// Задача 14. Аналогично на задача 13, напишете програма, която проверява дали 4 числа са геометрична прогресия.

// Вход:
//  1 2 4 8
// Изход:
//  1

// Вход:
//  1 3 5 7
// Изход:
//  0

#include <iostream>
using namespace std;

int main(){

    long long num1, num2, num3, num4;
    cin >> num1 >> num2 >> num3 >> num4;

    // Умножение на кръст (a * c = b * b), за да избегнем деление на дробни числа
    // num2 / num1 == num3 / num2 && num3 / num2 == num4 / num3
    if (num1 * num3 == num2 * num2 && num2 * num4 == num3 * num3) {
        cout << 1 << endl;
    } else {
        cout << 0 << endl;
    }

    return 0;
}

// 2. Геометрична прогресияКакво представлява? 
// Редица от числа, в която всеки следващ член се получава, като предходният се умножи по едно и също число (наречено знаменател - q). 
// Основно правило: Отношението (частното) между всеки два съседни члена е постоянно (винаги се умножава/дели на едно и също число).
// Пример: 2, 6, 18, 54
// Тук множителят е x3 (6 / 2 = 3, 18 / 6 = 3, 54 / 18 = 3).
// num2 / num1 == num3 / num2 (или чрез умножение на кръст: num1 x num3 == num2 x num2)